Config/InformationRegisters/ДанныеРеквизитовТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеРеквизитовТиповыхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязиПоТипу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Comment>0=Поле ввода, 1=Поле флажка; 0=Обычная группа, 1=Страница, 2=Страницы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппировкаЭлементов</Name>
					<Comment>0=Горизонтальная, 1=Вертикальная</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отображение</Name>
					<Comment>0=Нет, 1=РамкаГруппы, 2=Линия, 3=Отступ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаПодчиненныхЭлементов</Name>
					<Comment>0=Авто, 1=Одинаковая, 2=Левый широкий, 3=Левый очень широкий, 4=Левый узкий, 5=Левый очень узкий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РастягиватьПоГоризонтали</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоложениеЗаголовка</Name>
					<Comment>0=Авто, 1=Нет, 2=Лево, 3=Верх, 4=Право, 5=Низ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретитьИзменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НевидимыйЭлемент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпакованныеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РеквизитТиповойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СостоянияПоддержкиТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияПоддержкиТиповыхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРедактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируетсяССохранениемПоддержки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируетсяБезСохраненияПоддержки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/РеквизитыТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыТиповыхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТиповыеОперации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйРеквизитТиповойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеРеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПроводки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПоддержкиТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФункциональнойОпции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПоставляемыеРеквизитыТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоставляемыеРеквизитыТиповыхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПоставляемыеТиповыеОперации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязиПоТипу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаЭлементов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отображение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПодчиненныхЭлементов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РастягиватьПоГоризонтали</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИзменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НевидимыйЭлемент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпакованныеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФункциональнойОпции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ОбщегоНазначенияБГУПовтИсп/Ext/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// ОБЩЕГО НАЗНАЧЕНИЯ БГУ, ПРОЦЕДУРЫ И ФУНКЦИИ ПОВТОРНОГО ИСПОЛЬЗОВАНИЯ         //
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  

// См. описание ОбщегоНазначенияБГУ.ТаблицаЗначенийИзТабличногоДокументв
//
Функция ТаблицаЗначенийИзТабличногоДокументв(Знач ТаблицаИлиПуть) Экспорт 
	Возврат ОбщегоНазначенияБГУ.ТаблицаЗначенийИзТабличногоДокументв(ТаблицаИлиПуть);
КонецФункции	

Функция МетаданныеДокументовСПечатьюБухСправки() Экспорт
	
	СписокТипов = Новый Массив;
	
	ИсключаемыеТипыДокументов = Метаданные.ОпределяемыеТипы.ОбъектыБезПроцедурПечатиВМенеджере.Тип;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		Если ИсключаемыеТипыДокументов.СодержитТип(Тип("ДокументСсылка." + Документ.Имя)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Документ.Движения.Содержит(Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ) Тогда
			СписокТипов.Добавить(Документ);
		КонецЕсли;
		
	КонецЦикла;
	
	СписокТипов.Добавить(Метаданные.ЖурналыДокументов.ЖурналОпераций);

	Возврат СписокТипов;
	
КонецФункции

Функция СписокДокументовСДвижениямиПоРБ() Экспорт
	
	СписокТипов = Новый Массив;
	
	ИсключаемыеТипыДокументов = Метаданные.ОпределяемыеТипы.ОбъектыБезПроцедурПечатиВМенеджере.Тип;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		Если ИсключаемыеТипыДокументов.СодержитТип(Тип("ДокументСсылка." + Документ.Имя)) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Документ.Движения.Содержит(Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ) Тогда
			СписокТипов.Добавить(Тип("ДокументСсылка." + Документ.Имя));
		КонецЕсли;
		
	КонецЦикла;

	Возврат СписокТипов;
	
КонецФункции	

Функция СписокДокументовСДвижениямиПоРНРС() Экспорт
	
	СписокТипов = Новый Массив;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		
		Если Документ.Движения.Количество() > 1		
			ИЛИ (Документ.Движения.Количество() = 1
			И НЕ Документ.Движения.Содержит(Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ)) Тогда
			СписокТипов.Добавить(Тип("ДокументСсылка." + Документ.Имя));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокТипов;
	
КонецФункции	

Функция СвойствоЗначенияПеречисления(ЗначениеПеречисления, ИмяСвойства) Экспорт 
	
	ЗначениеСвойства = "";
	
	Попытка
		ОбъектМетаданных = ЗначениеПеречисления.Метаданные();
	Исключение
		Возврат ЗначениеСвойства;
	КонецПопытки;
    
	Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		Если ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
			ИмяПеречисления = ОбъектМетаданных.Имя; 
			ИндексЗначения = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления); 
			Если ИмяСвойства = "Индекс" Тогда
				ЗначениеСвойства = ИндексЗначения;
			ИначеЕсли ИмяСвойства = "Имя" Тогда	
				ЗначениеСвойства = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначения].Имя;
			ИначеЕсли ИмяСвойства = "Синоним" Тогда
				ЗначениеСвойства = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначения].Синоним;
			ИначеЕсли ИмяСвойства = "Комментарий" Тогда	
				ЗначениеСвойства = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначения].Комментарий; 
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
    	
	Возврат ЗначениеСвойства;
 	
КонецФункции	

Функция ЕстьПравоДоступа(Право, ПолноеИмяОбъектаМетаданных) Экспорт
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	Если ОбъектМетаданных<>Неопределено Тогда
		Возврат ПравоДоступа(Право, ОбъектМетаданных);
	Иначе
		Возврат Ложь
	КонецЕсли;
КонецФункции

// Возвращает ссылку спр. ИдентификаторыОбъектовМетаданных по реквизиту "ПолноеИмя"
// 
// Параметры:
//  ПолноеИмя - Строка - Полное имя
// 
// Возвращаемое значение:
//  СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка идентификатора объекта метаданных
Функция СсылкаИдентификатораОбъектаМетаданных(ПолноеИмя = "") Экспорт
	
	СсылкаИдентификатора = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИдентификаторыОбъектовМетаданных.Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = &ПолноеИмя
	|	И ИдентификаторыОбъектовМетаданных.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СсылкаИдентификатора =  Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат СсылкаИдентификатора;
	
КонецФункции	

// Возвращает валюту регламентированного учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту рег. учета. Если валюта рег. учета не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
// СправочникСсылка.Валюты
//
Функция ПолучитьВалютуРегламентированногоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции

Функция ЗначениеФункциональнойОпции(ИмяФО) Экспорт

	Возврат ПолучитьФункциональнуюОпцию(ИмяФО);

КонецФункции // ЗначениеФункциональнойОпции()

// Контроль соответствия КФО и КПС учетной политике на дату документа

Функция РеквизитыЗависящиеОтДаты(ТипМетаданных) Экспорт
	МассивРеквизитовКПС = Новый Массив;
	МассивРеквизитовКФО = Новый Массив;
	ТипКФО = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	ТипКПС = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
    ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ТипМетаданных);
	СпиисокРеквизитов = Новый СписокЗначений;
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		Если Реквизит.Тип = ТипКФО Тогда
			Для каждого Связь Из Реквизит.СвязиПараметровВыбора Цикл
				Если Связь.ПутьКДанным = "Дата" И Связь.ИзменениеЗначения = РежимИзмененияСвязанногоЗначения.НеИзменять Тогда
					МассивРеквизитовКФО.Добавить(Реквизит.Имя);		
				КонецЕсли;
			КонецЦикла; 
		ИначеЕсли Реквизит.Тип = ТипКПС Тогда
			Для каждого Связь Из Реквизит.СвязиПараметровВыбора Цикл
				Если Связь.ПутьКДанным = "Дата" И Связь.ИзменениеЗначения = РежимИзмененияСвязанногоЗначения.НеИзменять Тогда
					МассивРеквизитовКПС.Добавить(Реквизит.Имя);		
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	Для каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
	
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			Если Реквизит.Тип = ТипКФО Тогда
				Для каждого Связь Из Реквизит.СвязиПараметровВыбора Цикл
					Если Связь.ПутьКДанным = "Дата" И Связь.ИзменениеЗначения = РежимИзмененияСвязанногоЗначения.НеИзменять Тогда
						МассивРеквизитовКФО.Добавить(ТабличнаяЧасть.Имя+"."+Реквизит.Имя);		
					КонецЕсли;
				КонецЦикла; 
			ИначеЕсли Реквизит.Тип = ТипКПС Тогда
				Для каждого Связь Из Реквизит.СвязиПараметровВыбора Цикл
					Если Связь.ПутьКДанным = "Дата" И Связь.ИзменениеЗначения = РежимИзмененияСвязанногоЗначения.НеИзменять Тогда
						МассивРеквизитовКПС.Добавить(ТабличнаяЧасть.Имя+"."+Реквизит.Имя);		
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла; 
	СтруктураРеквизитов = Новый Структура("КПС, КФО", Новый ФиксированныйМассив(МассивРеквизитовКПС), Новый ФиксированныйМассив(МассивРеквизитовКФО));

    Возврат Новый ФиксированнаяСтруктура(СтруктураРеквизитов);
КонецФункции // РеквизитыЗависящиеОтДаты()

Функция РеквизитыОперацииЗависящиеОтДаты(ТиповаяОперация) Экспорт

	МассивРеквизитов = Новый Массив;
	ТипКФО = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	ТипКПС = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	ВЫБОР
	|		КОГДА РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|			ТОГДА ЕСТЬNULL(ПоставляемыеРеквизитыТиповыхОпераций.СвязиПараметровВыбора, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.СвязиПараметровВыбора, """")
	|	КОНЕЦ КАК СвязиПараметровВыбора,
	|	ВЫБОР
	|		КОГДА РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|			ТОГДА ЕСТЬNULL(ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки, """")
	|		ИНАЧЕ ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки, """")
	|	КОНЕЦ КАК УпакованныеНастройки,
	|	ВЫБОР
	|		КОГДА РеквизитыТиповыхОпераций.РеквизитПроводки = &ТипЕПСБУ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСчетЕПСБУ
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ПО РеквизитыТиповыхОпераций.Владелец = ТиповыеОперации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
	|	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
	|	И РеквизитыТиповыхОпераций.РеквизитПроводки В (&ТипКФО, &ТипКПС, &ТипЕПСБУ)";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("ТипКФО",   ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.КВД);
	Запрос.УстановитьПараметр("ТипКПС",   ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.КлассификационныеПризнакиСчетов);
	Запрос.УстановитьПараметр("ТипЕПСБУ", ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.СчетаЕПСБУ);
	ВсеРеквизиты = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекРеквизит Из ВсеРеквизиты Цикл
		
		Если ТекРеквизит.ЭтоСчетЕПСБУ Тогда
 			МассивРеквизитов.Добавить(ТекРеквизит.ИмяДляФормулы);
			Продолжить;
		КонецЕсли;
		
		УпакованныеНастройки = ?(ТипЗнч(ТекРеквизит.УпакованныеНастройки) = Тип("ХранилищеЗначения"), 
			ТекРеквизит.УпакованныеНастройки.Получить(), Неопределено);
		Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
			ТекстСвязиПараметровВыбора = "";
			УпакованныеНастройки.Свойство("СвязиПараметровВыбора", ТекстСвязиПараметровВыбора);
		Иначе
			ТекстСвязиПараметровВыбора = ТекРеквизит.СвязиПараметровВыбора;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекстСвязиПараметровВыбора)
			ИЛИ НЕ СтрНачинаетсяС(ТекстСвязиПараметровВыбора, "{""#""") Тогда
			Продолжить;
		КонецЕсли;
			
		СвязиПараметровВыбора = ЗначениеИзСтрокиВнутр(ТекстСвязиПараметровВыбора);
		
		Для каждого Связь Из СвязиПараметровВыбора Цикл
			Если Связь.Реквизит = "Объект.Дата" Тогда
 				МассивРеквизитов.Добавить(ТекРеквизит.ИмяДляФормулы);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивРеквизитов);

КонецФункции // РеквизитыОперацииЗависящиеОтДаты()

// Учет по ИФО

Функция ОпределитьМассивПолейИФО(ИмяРегистра) Экспорт
	
	МассивПолей = Новый Массив;
	ЭтоРБ = Ложь;
	ЭтоРН = Ложь;
	Если Метаданные.РегистрыБухгалтерии.Найти(ИмяРегистра) <> Неопределено Тогда
		ЭтоРБ = Истина;
	ИначеЕсли Метаданные.РегистрыНакопления.Найти(ИмяРегистра) <> Неопределено Тогда
		ЭтоРН = Истина;
	Иначе
		Возврат МассивПолей;
	КонецЕсли;
	
	Если ЭтоРБ Тогда
		ТекРегистр = Метаданные.РегистрыБухгалтерии[ИмяРегистра];
	Иначе
		ТекРегистр = Метаданные.РегистрыНакопления[ИмяРегистра];
	КонецЕсли;
	
	Для Каждого ТекИзмерение Из ТекРегистр.Измерения Цикл
		Если ТекИзмерение.Тип.СодержитТип(Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения")) Тогда
			МассивПолей.Добавить(ТекИзмерение.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из ТекРегистр.Реквизиты Цикл
		Если ТекРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения")) Тогда
			МассивПолей.Добавить(ТекРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПолей;
	
КонецФункции

#Область РезолюцииКомиссий

Функция ПолучитьПривязкуФормКДокументам() Экспорт
	
	Перем МассивКодов;
	
	Данные = Новый Структура();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РезолюцииКомиссий");
	
	Область = Макет.Области.Найти("ПривязкаФорм");
	
	Если Область = Неопределено Тогда
		ИмяСобытия = НСтр("ru='Чтение'");
		
		Комментарий = НСтр("ru='В макете ""Резолюции комиссий"" отсутствует обязательная область ""ПривязкаФорм"".
			|Возможно, макет был изменён'");
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,							// имя события
			УровеньЖурналаРегистрации.Ошибка,	// уровень
			,									// объект метаданных
			,									// данные
			Комментарий);						// комментарий
		
		Возврат Данные;
	КонецЕсли;
	
	НомераКолонок = Новый Структура();
	НомераКолонок.Вставить("КодФормы",		1);
	НомераКолонок.Вставить("ИмяДокумента",	2);
	
	ТолькоУникальныеЗначения = Истина;
	
	ВключатьПустые = Ложь;
	
	
	Для НомерСтроки = Область.Верх По Область.Низ Цикл
		
		МассивКодовФорм = СтрРазделить(Макет.Область(НомерСтроки, НомераКолонок.КодФормы).Текст, ", ", ВключатьПустые);
		
		ИмяДокумента = Макет.Область(НомерСтроки, НомераКолонок.ИмяДокумента).Текст;
		
		Если МассивКодовФорм.Количество() = 0 ИЛИ ПустаяСтрока(ИмяДокумента) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Данные.Свойство(ИмяДокумента, МассивКодов) Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКодовФорм, МассивКодов, ТолькоУникальныеЗначения);
		КонецЕсли;
		
		Данные.Вставить(ИмяДокумента, МассивКодовФорм);
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьПривязкуРезолюцийКФормам() Экспорт
	
	Перем	КодФормы,
			ТаблицаРезолюций;
	
	Данные = Новый Соответствие();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РезолюцииКомиссий");
	
	Область = Макет.Области.Найти("ПривязкаРезолюций");
	
	Если Область = Неопределено Тогда
		ИмяСобытия = НСтр("ru='Чтение'");
		
		Комментарий = НСтр("ru='В макете ""Резолюции комиссий"" отсутствует обязательная область ""ПривязкаРезолюций"".
			|Возможно, макет был изменён'");
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,							// имя события
			УровеньЖурналаРегистрации.Ошибка,	// уровень
			,									// объект метаданных
			,									// данные
			Комментарий);						// комментарий
		
		Возврат Данные;
	КонецЕсли;
	
	НомераКолонок = Новый Структура();
	НомераКолонок.Вставить("ИдентификаторРезолюции", 2);
	
	Для НомерСтроки = Область.Верх По Область.Низ Цикл
		
		ТекстЯчейки = Макет.Область(НомерСтроки, 1).Текст;
		
		ВидСтроки = ОпределитьВидСтроки(ТекстЯчейки);
		
		Если ВидСтроки.КодФормы Тогда
			
			// Ранее собранные строки
			Если КодФормы <> Неопределено И ТаблицаРезолюций <> Неопределено Тогда
				Данные.Вставить(КодФормы, ТаблицаРезолюций);
			КонецЕсли;
			
			// Будущие строки
			КодФормы = ТекстЯчейки;
			
			ТаблицаРезолюций = ОбщегоНазначенияБГУ.ПолучитьПустуюТаблицуРезолюцийФормы();
			
			Продолжить;
		КонецЕсли;
		
		Если ВидСтроки.Резолюция И ТаблицаРезолюций <> Неопределено Тогда
			ИдентификаторРезолюции = Макет.Область(НомерСтроки, НомераКолонок.ИдентификаторРезолюции).Текст;
			
			НоваяСтрока = ТаблицаРезолюций.Добавить();
			НоваяСтрока.Текст			= ТекстЯчейки;
			НоваяСтрока.Идентификатор	= ИдентификаторРезолюции;
			
			Продолжить;
		КонецЕсли;
		
		Если ВидСтроки.ЗавершениеБлока И ТаблицаРезолюций <> Неопределено Тогда
			Данные.Вставить(КодФормы, ТаблицаРезолюций);
			
			КодФормы = Неопределено;
			ТаблицаРезолюций = Неопределено;
			
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаРезолюций <> Неопределено Тогда
		Данные.Вставить(КодФормы, ТаблицаРезолюций);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РезолюцииКомиссий

Функция ОпределитьВидСтроки(ПроверяемаяСтрока)
	
	ВидСтроки = Новый Структура("
		|КодФормы,
		|ЗавершениеБлока,
		|Резолюция", Ложь, Ложь, Ложь);
		
	Если ПустаяСтрока(ПроверяемаяСтрока) Тогда
		ВидСтроки.Вставить("ЗавершениеБлока", Истина);
		
		Возврат ВидСтроки;
	КонецЕсли;
	
	Если СтрДлина(ПроверяемаяСтрока) = 7 Тогда
		Попытка
			ВремЧисло = Число(ПроверяемаяСтрока);
			
			ВидСтроки.Вставить("КодФормы", Истина);
		Исключение
			ВидСтроки.Вставить("Резолюция", Истина);
		КонецПопытки;
		
		Возврат ВидСтроки;
	КонецЕсли;
	
	ВидСтроки.Вставить("Резолюция", Истина);
	
	Возврат ВидСтроки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
